<?php

return [
	'upload_error' = > 'ошибка: произошла ошибка загрузки',
	'invalid_resource_params' = > 'ошибка: отсутствуют необходимые параметры файла',
	'invalid_resource_size' = > 'ошибка: недопустимый размер файла',
	'invalid_resource_type' = > 'ошибка: недопустимый тип файла',
	'create_subfolder_fail' = > 'ошибка: не удалось создать подпапку',
	'invalid_chunk_params' = > 'ошибка: отсутствуют необходимые параметры блока файлов',
	'invalid_operation' = > 'ошибка: незаконная операция',
	'http_post_only' = > 'ошибка: файл должен быть загружен через HTTP POST',
	'create_resource_fail' = > 'ошибка: не удалось создать файл',
	'write_resource_fail' = > 'ошибка: не удалось записать файл',
	'delete_resource_fail' = > 'ошибка: не удалось удалить файл',
	'rename_resource_fail' = > 'ошибка: не удалось переименовать файл',
	'create_header_fail' = > 'ошибка: не удалось создать заголовочный файл',
	'write_header_fail' = > 'ошибка: не удалось записать заголовочный файл',
	'read_header_fail' = > 'ошибка: не удалось прочитать заголовочный файл',
	'delete_header_fail' = > 'ошибка: не удалось удалить заголовочный файл',
	'missing_mimetype' = > 'ошибка: отсутствует сопоставление mime-типа для таких файлов'
];